Repository: sasokl/AIDevHelper
Catalog: Resources/Lang.*.resx
Languages: de, fr, ru

source: Project Folder
de: Projektordner
fr: Dossier du projet
ru: Папка проекта

source: Project Root Folder:
de: Projektstammordner:
fr: Dossier racine du projet :
ru: Корневая папка проекта:

source: Select
de: Auswählen
fr: Sélectionner
ru: Выбрать

source: Apply .gitignore filter
de: .gitignore-Filter anwenden
fr: Appliquer le filtre .gitignore
ru: Применить фильтр .gitignore

source: Options
de: Optionen
ru: Опции

source: Calculate file stats
de: Dateistatistiken berechnen
fr: Calculer les statistiques des fichiers
ru: Рассчитать статистику файлов

source: Stop
de: Stoppen
fr: Arrêter
ru: Остановить

source: Project Structure
de: Projektstruktur
fr: Structure du projet
ru: Структура проекта

source: Selected Items Stats
de: Statistiken der ausgewählten Elemente
fr: Statistiques des éléments sélectionnés
ru: Статистика выбранных элементов

source: Task / User Request
de: Aufgabe / Benutzeranfrage
fr: Tâche / Demande utilisateur
ru: Задача / Запрос пользователя

source: Describe your task:
de: Beschreiben Sie Ihre Aufgabe:
fr: Décrivez votre tâche :
ru: Опишите вашу задачу:

source: Generate AI Request
de: KI-Anfrage generieren
fr: Générer une demande d'IA
ru: Сгенерировать запрос ИИ

source: Partial Structure
de: Teilstruktur
fr: Structure partielle
ru: Частичная структура

source: Full Structure
de: Vollständige Struktur
fr: Structure complète
ru: Полная структура

source: Return full code for each file
de: Vollständigen Code für jede Datei zurückgeben
fr: Retourner le code complet pour chaque fichier
ru: Вернуть полный код для каждого файла

source: Include explanation summary
de: Eine Zusammenfassung der Erklärungen einfügen
fr: Inclure un résumé d'explication
ru: Включить сводку объяснений

source: Generate Request
de: Anfrage generieren
fr: Générer la demande
ru: Сгенерировать запрос

source: AI Interaction
de: Interaktion mit KI
fr: Interaction avec l'IA
ru: Взаимодействие с ИИ

source: Apply Changes
de: Änderungen anwenden
fr: Appliquer les changements
ru: Применить изменения

source: Calculating stats...
de: Statistiken werden berechnet...
fr: Calcul des statistiques...
ru: Расчет статистики...

source: Done
de: Fertig
fr: Terminé
ru: Готово

source: Cancelled
de: Abgebrochen
fr: Annulé
ru: Отменено

source: Original files for modification:
de: Originaldateien zur Änderung:
fr: Fichiers originaux pour modification :
ru: Исходные файлы для изменения:

# ReturnResultInJson
source: Return the result in JSON format for only the changed files (keys: delete, modify, create):
de: Geben Sie das Ergebnis im JSON-Format nur für die geänderten Dateien zurück (Schlüssel: delete, modify, create):
fr: Retournez le résultat au format JSON pour les fichiers modifiés uniquement (clés : delete, modify, create) :
ru: Верните результат в формате JSON только для измененных файлов (ключи: delete, modify, create):

# ReturnFullCodeInstruction
source: Important: Return the FULL code for each modified file. No lineStart/lineEnd needed.
de: Wichtig: Geben Sie den VOLLSTÄNDIGEN Code für jede geänderte Datei zurück. Kein lineStart/lineEnd erforderlich.
fr: Important : Retournez le code COMPLET pour chaque fichier modifié. Pas besoin de lineStart/lineEnd.
ru: Важно: Верните ПОЛНЫЙ код для каждого измененного файла. Не нужно lineStart/lineEnd.

# LineStartEndInstruction
source: Important: 'lineStart' and 'lineEnd' are inclusive. If you do not provide full code, the program will remove lines in that range and insert the new code lines.
de: Wichtig: 'lineStart' und 'lineEnd' sind inklusive. Wenn Sie keinen vollständigen Code angeben, entfernt das Programm die Zeilen in diesem Bereich und fügt die neuen Codezeilen ein.
fr: Important : 'lineStart' et 'lineEnd' sont inclusifs. Si vous ne fournissez pas le code complet, le programme supprimera les lignes dans cette plage et insérera les nouvelles lignes de code.
ru: Важно: 'lineStart' и 'lineEnd' являются инклюзивными. Если вы не предоставляете полный код, программа удалит строки в этом диапазоне и вставит новые строки кода.

# IncludeExplanationInstruction
source: Also, provide a summary list of changes (what was modified, deleted, or created) separately from the JSON output.
de: Geben Sie außerdem eine Zusammenfassung der Änderungen (was geändert, gelöscht oder erstellt wurde) getrennt vom JSON-Ausgabe an.
fr: En outre, fournissez une liste récapitulative des changements (ce qui a été modifié, supprimé ou créé) séparément de la sortie JSON.
ru: Также предоставьте сводный список изменений (что было изменено, удалено или создано) отдельно от JSON-выхода.

# CleanCodeInstruction
source: Additionally, please ensure the modifications follow 'Clean Code' principles and best practices as if written by a professional developer with years of experience, balancing optimization and readability.
de: Stellen Sie außerdem sicher, dass die Änderungen den Prinzipien des 'Sauberen Codes' und bewährten Praktiken entsprechen, als wären sie von einem erfahrenen Entwickler geschrieben, der Optimierung und Lesbarkeit ausbalanciert.
fr: De plus, assurez-vous que les modifications suivent les principes du 'Code Propre' et les meilleures pratiques, comme si elles étaient écrites par un développeur professionnel avec des années d'expérience, en équilibrant l'optimisation et la lisibilité.
ru: Не сокращайте код; предоставьте полное содержимое файла.

# TestInstructions
source: After providing the JSON, please also include instructions on how to test or verify these modifications.
de: Geben Sie nach dem JSON auch Anweisungen an, wie diese Änderungen getestet oder überprüft werden können.
fr: Après avoir fourni le JSON, veuillez également inclure des instructions sur la manière de tester ou de vérifier ces modifications.
ru: Нет текста для копирования.

# MultipleApproachesInstruction
source: If multiple approaches exist, list them from best to worst.
de: Wenn mehrere Ansätze existieren, listen Sie diese vom besten zum schlechtesten auf.
fr: S'il existe plusieurs approches, listez-les de la meilleure à la pire.

# KeyPointsInstruction
source: Finally, describe the key points changed, how they work, and how they interrelate.
de: Beschreiben Sie abschließend die wichtigsten geänderten Punkte, wie sie funktionieren und wie sie miteinander zusammenhängen.
fr: Enfin, décrivez les points clés qui ont été modifiés, comment ils fonctionnent et comment ils sont interrelated.

# PasteJsonResponse
source: Please paste the JSON response from AI.
de: Bitte fügen Sie die JSON-Antwort der KI ein.
fr: Veuillez coller la JSON-Antwort von KI.

source: Changes applied successfully.
de: Änderungen erfolgreich angewendet.
fr: Changements appliqués avec succès.

source: Error applying changes
de: Fehler beim Anwenden der Änderungen
fr: Erreur lors de l'application des changements

source: Project Info
de: Projektinformationen
fr: Informations sur le projet

source: Project Name:
de: Projektname:
fr: Nom du projet :

source: Tech Stack:
de: Technologie-Stack:
fr: Pile technologique :

source: Description:
de: Beschreibung:

source: Additional Requirements:
de: Zusätzliche Anforderungen:
fr: Exigences supplémentaires :

source: New Project Actions
de: Aktionen für neues Projekt
fr: Actions pour le nouveau projet

# CreateNewProject
source: Create a new project
de: Ein neues Projekt erstellen
fr: Créer un nouveau projet

source: Response requirements
de: Antwortanforderungen
fr: Exigences de réponse

# DoNotShortenCode
source: Do not shorten the code; provide full file content.
de: Verkürzen Sie den Code nicht; geben Sie den vollständigen Dateiinhalt an.
fr: Ne pas raccourcir le code ; fournissez le contenu complet du fichier.

source: No text to copy.
de: Kein Text zum Kopieren.
fr: Aucun texte à copier.
